DataFrame

In [3]:
import numpy as np
import pandas as pd

In [4]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
column = ['D', 'E', 'F']

df = pd.DataFrame(data=data, index= ['A', 'B', 'C'], columns=column)
df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [22]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"]
        }
#print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [17]:
# (1) DataFrame 생성시 인덱스 지정
df = pd.DataFrame(data, index = ['A', 'B', 'C', 'D'])
df

  country  rank grade
A     kor     1     A
B     usa     2     B
C   china     3     C
D   japan     4     D

In [18]:
# (2) df.index로 인덱스 지정
df.index = ['A', 'B', 'C', 'D']
df

  country  rank grade
A     kor     1     A
B     usa     2     B
C   china     3     C
D   japan     4     D

In [23]:
# (3) df.set_index로 인덱스 지정
# df = df.set_index('grade')
df = df.set_index(['grade', 'rank'])
df

데이터 셀렉션
DataFrame에서 값을 불러오는 방법

1. []
ex)df.컬럼, df.['컬럼'], df[1:3]

2. loc[인덱스명, 컬럼명] #명칭(label) 기반 인덱싱

           country
grade rank
A     1        kor
B     2        usa
C     3      china
D     4      japan

### 데이터 셀렉션

DataFrame에서 값을 불러오는 방법

1. []
ex)df.컬럼, df.['컬럼'], df[1:3]

2. loc[인덱스명, 컬럼명] #명칭(label) 기반 인덱싱

 label이나 boolean array로 인덱싱하는 방법
 사람이 읽을 수 있는 라벨 값으로 특정 값들을 골라오는 방법
  
3. iloc[인덱스, 컬럼인덱스] #위치(position) 기반 인덱싱

In [24]:
# DataFrame 생성

data = {
        "country": ['kor', 'usa', 'china', 'japan'],
        "rank": [1, 2, 3, 4],
        'grade' : ["A", "B", "C", "D"]
        }
#print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [25]:
# (1) df.컬럼, df['컬럼']

## 하나의 컬럼 조회
df.country

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [28]:
df[['country', 'grade']]  # 2개 이상 컬럼 조회 []리스트로 감싸기

  country grade
0     kor     A
1     usa     B
2   china     C
3   japan     D

In [29]:
# (2) loc[인덱스명, 컬럼명]

## 인덱스 값이 0인 행 조회
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [30]:
## 2개 이상의 행 조회
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [31]:
df.loc[[0,2]]  # []활용하여 인덱스 값 0, 2행 가져오기

  country  rank grade
0     kor     1     A
2   china     3     C

In [32]:
df.loc[0, 'grade']  #행과 열의 좌표. 0번째 행, 'grade'컬럼 추출

'A'

In [33]:
df.loc[0:2, ['country', 'grade']]

  country grade
0     kor     A
1     usa     B
2   china     C

In [35]:
df.loc[(df['grade']=='A') | (df['rank'] > 2)]  # 2개 컬럼 이상, 2개 조건 이상 추출

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

In [37]:
df['rank']>2

0    False
1    False
2     True
3     True
Name: rank, dtype: bool